# ####################################################################

#  Created by Encounter(R) RTL Compiler RC14.27 - v14.20-s064_1 on Wed Jan 12 11:11:10 +0300 2022

# ####################################################################

set sdc_version 1.7

set_units -capacitance 1000.0fF
set_units -time 1000.0ps

# Set the current design
current_design subsystem

create_clock -name "clk" -add -period 50.0 -waveform {0.0 25.0} [get_ports clk]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay -min 5.0 [get_ports {input_rsvd[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 5.0 [get_ports {input_rsvd[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 5.0 [get_ports {input_rsvd[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 5.0 [get_ports {input_rsvd[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 5.0 [get_ports {input_rsvd[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 5.0 [get_ports {input_rsvd[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 5.0 [get_ports {input_rsvd[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 5.0 [get_ports {input_rsvd[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 5.0 [get_ports {input_rsvd[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 5.0 [get_ports {input_rsvd[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 5.0 [get_ports {input_rsvd[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 5.0 [get_ports {input_rsvd[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 5.0 [get_ports {input_rsvd[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 5.0 [get_ports {input_rsvd[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 5.0 [get_ports {input_rsvd[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 5.0 [get_ports {input_rsvd[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 16.0 [get_ports {input_rsvd[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 16.0 [get_ports {input_rsvd[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 16.0 [get_ports {input_rsvd[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 16.0 [get_ports {input_rsvd[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 16.0 [get_ports {input_rsvd[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 16.0 [get_ports {input_rsvd[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 16.0 [get_ports {input_rsvd[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 16.0 [get_ports {input_rsvd[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 16.0 [get_ports {input_rsvd[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 16.0 [get_ports {input_rsvd[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 16.0 [get_ports {input_rsvd[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 16.0 [get_ports {input_rsvd[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 16.0 [get_ports {input_rsvd[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 16.0 [get_ports {input_rsvd[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 16.0 [get_ports {input_rsvd[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 16.0 [get_ports {input_rsvd[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 5.0 [get_ports {output_rsvd[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 5.0 [get_ports {output_rsvd[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 5.0 [get_ports {output_rsvd[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 5.0 [get_ports {output_rsvd[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 5.0 [get_ports {output_rsvd[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 5.0 [get_ports {output_rsvd[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 5.0 [get_ports {output_rsvd[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 5.0 [get_ports {output_rsvd[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 5.0 [get_ports {output_rsvd[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 5.0 [get_ports {output_rsvd[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 5.0 [get_ports {output_rsvd[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 5.0 [get_ports {output_rsvd[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 5.0 [get_ports {output_rsvd[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 5.0 [get_ports {output_rsvd[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 5.0 [get_ports {output_rsvd[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 5.0 [get_ports {output_rsvd[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 16.0 [get_ports {output_rsvd[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 16.0 [get_ports {output_rsvd[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 16.0 [get_ports {output_rsvd[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 16.0 [get_ports {output_rsvd[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 16.0 [get_ports {output_rsvd[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 16.0 [get_ports {output_rsvd[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 16.0 [get_ports {output_rsvd[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 16.0 [get_ports {output_rsvd[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 16.0 [get_ports {output_rsvd[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 16.0 [get_ports {output_rsvd[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 16.0 [get_ports {output_rsvd[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 16.0 [get_ports {output_rsvd[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 16.0 [get_ports {output_rsvd[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 16.0 [get_ports {output_rsvd[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 16.0 [get_ports {output_rsvd[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 16.0 [get_ports {output_rsvd[15]}]
set_wire_load_selection_group "4_metls_routing" -library "D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C"
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/LGCN_5VX1]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/LGCN_5VX2]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/LGCN_5VX4]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/LGCP_5VX1]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/LGCP_5VX2]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/LGCP_5VX4]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/LSGCN_5VX1]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/LSGCN_5VX2]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/LSGCN_5VX4]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/LSGCP_5VX1]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/LSGCP_5VX2]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/LSGCP_5VX4]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/LSOGCN_5VX1]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/LSOGCN_5VX2]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/LSOGCN_5VX4]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/LSOGCP_5VX1]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/LSOGCP_5VX2]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/LSOGCP_5VX4]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/STE_5VX1]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/STE_5VX2]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/STE_5VX3]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/STE_5VX4]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/ST_5VX1]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/ST_5VX2]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/ST_5VX3]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/ST_5VX4]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/ANTENNACELLN2_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/ANTENNACELLN5_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/ANTENNACELLNP2_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/ANTENNACELLP2_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/ANTENNACELLP5_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/DECAP5_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/DECAP7_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/DECAP10_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/DECAP15_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/DECAP25_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNE2_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNE3_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNE4_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNE5_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNE6_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNE7_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNE8_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNE9_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNE10_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNE11_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNE12_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNE13_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNE14_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNE15_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNE16_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNE17_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNE18_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNE19_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNE20_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNE21_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNE22_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNE23_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNE24_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNE25_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNE26_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNE27_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNE28_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNE29_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNE30_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNE31_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNE32_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNED5_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNED6_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNED7_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNED8_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNED9_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNED10_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNED11_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNED12_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNED13_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNED14_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNED15_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNED16_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNED17_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNED18_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNED19_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNED20_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNED21_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNED22_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNED23_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNED24_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNED25_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNED26_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNED27_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNED28_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNED29_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNED30_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNED31_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FCNED32_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FEED1_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FEED2_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FEED3_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FEED5_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FEED7_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FEED10_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FEED15_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/FEED25_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/SIGNALHOLD_5V]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/MPROBEBU_5VX8]
set_dont_use [get_lib_cells D_CELLS_5V_LP5MOS_MOS5_typ_5_00V_25C/MPROBE_5V]
set_clock_uncertainty -setup 5.0 [get_ports clk]
set_clock_uncertainty -hold 5.0 [get_ports clk]
